pregunta 7/app/Models/CrudModel.php

INSERT INTO `usuario` (`ci`, `nombre`, `paterno`, `contrasenia`) VALUES ('1', '1', '1', 'pswd000')
INSERT INTO `alumno` (`ci_alumno`, `idmat`, `depto`, `promedio`) VALUES ('1', 'MAT001', '-', 0)
---
		public function insertar($datos,$datos2) {
			$Nombres = $this->db->table('usuario');
			$Nombres->insert($datos);
			$Nombres2 = $this->db->table('alumno');
			$Nombres2->insert($datos2);

UPDATE `usuario` SET `nombre` = 'alexis', `paterno` = 'cundir'
WHERE `ci` = '0'
---
		public function actualizar($data, $ci) {
			$Nombres = $this->db->table('usuario');
			$Nombres->set($data);
			$Nombres->where('ci', $ci);
			return $Nombres->update();